app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-22 02:27:17.404705"], ["email", "me2@me.com"], ["name", "me2"], ["password", "password"], ["updated_at", "2014-09-22 02:27:17.404705"]]
---
    def create

	    @user = User.new(user_params)
    	if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "users" SET "email" = ?, "name" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["email", "meUpdated@update.com"], ["name", "meUpdated"], ["password", "password"], ["updated_at", "2014-09-24 00:04:37.244902"]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)